config.org
* General config
Lexical binding tagging
#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src

** Personal information
#+begin_src emacs-lisp
(setq user-full-name "Javier Castilla"
      user-mail-address "jcastp@pm.me")
#+end_src

** System information
Variables to conditional load based on systems or locations.
*** based on machine names
Defining variables for conditional execution, based on machines:
#+begin_src emacs-lisp
  ;; working laptop vm
  (defvar my-worksystem-p (equal (system-name) "lubuntuwork"))
  ;; My desktop machine, able to run anything
  (defvar my-desktopsystem-p (equal (system-name) "olimpo"))
  ;; Writing machines, probably we can strip some features
  (defvar my-writinglaptop-p
    (or (equal (system-name) "argos") (equal (system-name) "caliope"))
    )
#+end_src

*** bases on environment variables
Work environment
#+begin_src emacs-lisp
  (defvar my-homeenvironment-p (string= (getenv "WORKING") "HOME"))
  (defvar my-workenvironment-p (string= (getenv "WORKING") "WORK"))
#+end_src
** Unmap the C-z key
Unmap the C-z key, so no way to minimize or suspend emacs accidentally.

#+begin_src emacs-lisp
(global-unset-key (kbd "C-z"))
#+end_src

** free-keys
To know which keys are still free
#+begin_src emacs-lisp :tangle packages.el
(package! free-keys
  :recipe (:host github :repo "Fuco1/free-keys"))
#+end_src

** Movement
Some keys redefined to better adjust to the whole emacs key environment.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-p") 'backward-paragraph)
  (global-set-key (kbd "M-n") 'forward-paragraph)
#+end_src

** auto revert mode
When a file is changed in disk, the buffer reloads to reflect that change.

#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

Change dired buffers when the directory is changed:

#+begin_src emacs-lisp
  ;; auto refresh dired when file changes
  (add-hook! 'dired-mode-hook 'auto-revert-mode)
#+end_src

** Bookmarks
All the config related to the bookmarks.

#+begin_src emacs-lisp
(setq bookmark-default-file "~/Nextcloud/config/.emacs.d/bookmarks")  ;;define file to use.
(setq bookmark-save-flag 1)  ;save bookmarks to .emacs.bmk after each entry
#+end_src

** TODO set firefox as the default browser
Setting firefox as the default browser.
Using the firefox-esr, as I don't like snap package ...
#+begin_src emacs-lisp
  (setq browse-url-firefox-program "firefox-esr")
  (setq browse-url-browser-function 'browse-url-firefox)
#+end_src
** Start maximized
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

* Editing
** Undo
Undo binded to C-z
#+begin_src emacs-lisp
  (global-set-key (kbd "C-z") #'undo)
#+end_src

** Abbreviation mode
Defines a set of abbreviations that permits complete words with just some characters.

#+begin_src emacs-lisp
  ;;where do we read the abbrevs from
  (setq abbrev-file-name "~/Nextcloud/config/.emacs.d/abbrev_defs")
  (setq-default abbrev-mode t)
  (setq save-abbrevs 'silent)        ;; save abbrevs when files are saved
#+end_src
** Flyspell mode
Automatic spelling in the buffer
This conflicts with orgmode archive C-c $
https://www.gnu.org/software/emacs/manual/html_node/emacs/Spelling.html

#+begin_src emacs-lisp
  (add-hook! 'text-mode-hook 'flyspell-mode)

  ; inverse video for mispellings
  (global-font-lock-mode t)
  ;;  (custom-set-faces '(flyspell-incorrect ((t (:inverse-video t)))))

  ; custom location of the dictionary
  (setq ispell-personal-dictionary "~/Nextcloud/config/.emacs.d/dict")

  ; save the dictionary without asking
  (setq ispell-silently-savep t)
#+end_src
** beacon
When the windows moves, the cursor gets highlighted.
https://github.com/Malabarba/beacon

#+begin_src emacs-lisp :tangle packages.el
(package! beacon
  :recipe (:host github :repo "Malabarba/beacon"))
#+end_src

#+begin_src emacs-lisp
(use-package! beacon
    ;;:quelpa (beacon :fetcher github :repo "Malabarba/beacon")
    ;;:ensure t
    :config
      (beacon-mode 1)
      (setq beacon-push-mark 35
          beacon-blink-duration 0.5
          beacon-blink-delay 0.5
          beacon-blink-when-focused t
          beacon-color "deep sky blue")
  )
;; (after! beacon
;;   (beacon-mode 1)
;;   (setq beacon-push-mark 35
;;         beacon-blink-duration 0.5
;;         beacon-blink-delay 0.5
;;         beacon-blink-when-focused t
;;         beacon-color "deep sky blue")
;;   )
#+end_src
** guess-language
Guess the language based on the text of the file, and use the corresponding dictionary to do the spell correction.
https://github.com/tmalsburg/guess-language.el

#+begin_src emacs-lisp :tangle packages.el
(package! guess-language
  :recipe (:host github :repo "tmalsburg/guess-language.el"))
#+end_src

#+begin_src emacs-lisp
  (use-package guess-language
    ;;:quelpa (guess-language :fetcher github :repo "tmalsburg/guess-language.el")
    ;;:ensure t
    :config
      (setq guess-language-languages '(es en))
      (setq guess-language-min-paragraph-length 80)
      :hook (text-mode-hook . (lambda () (guess-language-mode 1)))
  )
;; (after! guess-language
;;   (setq guess-language-languages '(es en))
;;   (setq guess-language-min-paragraph-length 80)
;;   (add-hook 'text-mode-hook (lambda () (guess-language-mode 1)))
;; )
#+end_src
** electric pair mode
To automatically close parenthesis and and other punctuation signs.

#+begin_src emacs-lisp
  (electric-pair-mode 1)
  ;; make electric-pair-mode work on more sets of punctuation signs.
  (setq electric-pair-pairs
         '(
           (?\¡ . ?\!)
           (?\¿ . ?\?)
           )
   )

  (setq electric-pair-inhibit-predicate
         `(lambda (c)
            (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))
  )
#+end_src
** yasnippet
*** yasnippet load custom directories
Modify yas-snippet-dirs to add my own snippets.
#+begin_src emacs-lisp
(add-to-list 'yas-snippet-dirs "/home/jcastp/Nextcloud/config/.emacs.d/snippets/" t)
#+end_src

* UI
** Define fonts
#+begin_src emacs-lisp
(setq
  ;; Font used for source code
  ;; doom-font (font-spec :family "JetBrains Mono" :size 14 :weight 'Medium)
  ;; doom-font (font-spec :family "Fira Code" :size 14 :weight 'Medium)
  ;; doom-font (font-spec :family "Hasklig" :size 14 :weight 'Medium)
  ;; doom-font (font-spec :family "Iosevka Fixed" :size 16 :weight 'Medium)
  ;; doom-font (font-spec :family "Hack" :size 14)

  ;; Font used for normal writing
  ;;doom-variable-pitch-font (font-spec :family "Gentium Basic" :size 18)
  ;;doom-variable-pitch-font (font-spec :family "ETBookOT" :size 18)
  ;;doom-variable-pitch-font (font-spec :family "ETBembo" :size 18)
  doom-variable-pitch-font (font-spec :family "EB Garamond 12" :size 18 :weight 'Medium)
  ; When you want to have a different fixed font for the variable one
  ;; doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 16 :weight 'Extralight)
  ;;doom-variable-pitch-font (font-spec :family "Iosevka" :size 16 :weight 'Regular)
  )
#+end_src

** Font size increase/decrease
Increase or decrease the font size

#+begin_src emacs-lisp
  (global-set-key (kbd "M-+") 'text-scale-increase)
  (global-set-key (kbd "M--") 'text-scale-decrease)
#+end_src
** full path in the title bar
Put the complete path on the title bar, along the filename.

#+begin_src emacs-lisp
  (setq-default frame-title-format "%b - (%f)")
#+end_src
** Time and date
Put time and date on the status line

#+begin_src emacs-lisp
  (setq display-time-day-and-date t
        display-time-24hr-format t)
  (display-time)
#+end_src
** Open indirect buffer
Open a branch into a different frame, but the same buffer:

#+begin_src emacs-lisp
;; this is done to open the indirect buffer in another window
;; instead on the main one
(after! org
  (setq org-indirect-buffer-display 'other-window)

  (defun my/org-tree-open-in-right-frame ()
    (interactive)
    (org-tree-to-indirect-buffer)
    (windmove-right)
    )
  (global-set-key (kbd "C-c 8" ) 'my/org-tree-open-in-right-frame)
  )
#+end_src
** TODO tab-bar-mode
tab-bar-mode seems to comply with all my requirements to store the configuration of the buffers and frames. This, coupled with desktop saving and restoring, can be the answer.

#+begin_src emacs-lisp
  ;;(tab-bar-mode 1)
  ;; Map the not mapped but useful functions
  (global-set-key (kbd "C-x t s") 'tab-list)
  (global-set-key (kbd "C-x t a") 'tab-recent)
  ;; Check if it is worth to enable the tab-bar-history-mode
  ;; and configure the commands to browse the history
#+end_src

** ace-window
Better selection character
#+begin_src emacs
(custom-set-faces!
  '(aw-leading-char-face
    :foreground "white" :background "red"
    :weight bold :height 2.5 :box (:line-width 10 :color "red")))
#+end_src

* Navigation
** Uniquify
When several buffers visit identically-named files, Emacs must give the buffers distinct names. The usual method for making buffer names unique adds ‘<2>’, ‘<3>’, etc. to the end of the buffer names (all but one of them).

The forward naming method includes part of the file's directory name at the beginning of the buffer name
https://www.gnu.org/software/emacs/manual/html_node/emacs/Uniquify.html

#+begin_src emacs-lisp
  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)
#+end_src

** Key chords
Shortcuts to commands using just quick key combinations.

#+begin_src emacs-lisp :tangle packages.el
(package! key-chord
  :recipe (:host github :repo "emacsorphanage/key-chord"))
#+end_src

#+begin_src emacs-lisp
  (use-package key-chord
    ;;:quelpa (key-chord :fetcher github :repo "emacsorphanage/key-chord")
    ;;:ensure t
    :init
      (key-chord-mode 1)
    :config
      ;; Max time delay between two key presses to be considered a key chord
      (setq key-chord-two-keys-delay 0.1)
      ;; Max time delay between two presses of the same key to be considered a key chord.
      ;; Should normally be a little longer than `key-chord-two-keys-delay'.
      (setq key-chord-one-key-delay 0.2) ; default 0.2
  )
;; (after! key-chord
;;   (key-chord-mode 1)
;;   ;; Max time delay between two key presses to be considered a key chord
;;   (setq key-chord-two-keys-delay 0.1)
;;   ;; Max time delay between two presses of the same key to be considered a key chord.
;;   ;; Should normally be a little longer than `key-chord-two-keys-delay'.
;;   (setq key-chord-one-key-delay 0.2) ; default 0.2
;; )
#+end_src

*** key chords for functions
Description of the configured key chords.

#+begin_src emacs-lisp
  (key-chord-define-global "ññ" 'eshell)
;;  (key-chord-define-global "kk" 'other-window)
  (key-chord-define-global "hh" 'ace-window)
  (key-chord-define-global "jj" 'avy-goto-char-2)
  (key-chord-define-global "jl" 'avy-goto-line)
;;  (key-chord-define-global "zz" 'undo-tree-visualize)
  ;(key-chord-define-global "ww" 'hydra-move/body)
  ;(key-chord-define-global "yy" 'hydra-buffer-mgmt/body)
#+end_src

** imenu-list
Better menus list
#+begin_src emacs-lisp :tangle packages.el
(package! imenu-list
  :recipe (:host github :repo "bmag/imenu-list"))
#+end_src

#+begin_src emacs-lisp
  ;; put the imenu in the position we want to
  (setq imenu-list-position 'right)
  ;; Establish the depth of the entries shown
  (setq org-imenu-depth 5)
  ;; map the keys
  (global-unset-key (kbd "M-i"))
  (global-set-key (kbd "C-c s I") #'imenu-list-smart-toggle)
  ;; Once you open imenu, focus on it
  (setq imenu-list-focus-after-activation t)
#+end_src
** consult
Better search
#+begin_src emacs-lisp
(global-set-key (kbd "C-s") #'consult-line)
#+end_src
* orgmode
** New priorities
Priorities from A to E, and with new colors
#+begin_src emacs-lisp
(setq org-priority-highest ?A
      org-priority-lowest ?E
      org-priority-faces
      '((?A . 'all-the-icons-red)
        (?B . 'all-the-icons-orange)
        (?C . 'all-the-icons-yellow)
        (?D . 'all-the-icons-green)
        (?E . 'all-the-icons-blue))
      )
#+end_src
** Custom notes and timestamp
Put a note or a timestamp when something changes. For example:
- When the tasks is marked as DONE
- When the schedule or deadline date is changed

#+begin_src emacs-lisp
(after! org
  ;; Adds a timestamp to the state
  (setq org-log-done 'time)

  ;; Adds a custom note to the state
  (setq org-log-done 'note)

  ;; When the deadline or the schedule date is moved.
  ;; to keep track of how many times I have moved a task to the future.
  (setq org-log-redeadline (quote time))
  (setq org-log-reschedule (quote time))
)
#+end_src
** Custom states for the tasks
These are the custom states for the tasks, and the character associated to it.

#+begin_src emacs-lisp
(after! org
(setq org-todo-keywords
      '(
        ;; Status for tasks
        (sequence "TODO(t)" "ONGOING(r!)" "WAITING(w@/!)" "|" "DONE(d!)" "CANCELED(c@/!)")
        ;; Status for writing
        (sequence "TOWRITE(y)" "TOREVIEW(u@/!)" "REDO(i@/!)" "|" "FINISHED(o!)" "PURGE(p@/!)")
        )
      )
)
#+end_src
** orgmode Agenda
All the agenda configs

*** Agenda files
We define the agenda files in this variable

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '(
                           ;; normal task files
                           "~/Nextcloud/agenda/tasks.org"
                           "~/Nextcloud/agenda/inbox.org"
                           ;; doom config, for the
                           "~/.doom.d/config.org"
                           )
  )
)
#+end_src

*** Get rid of the DONE tasks in the agenda view
We dont want the cluttering in our views. If a task is done, don't show it on the agenda view.

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-timestamp-if-done t)
  )
#+end_src

