packages.el
(package! free-keys
  :recipe (:host github :repo "Fuco1/free-keys"))

(package! beacon
  :recipe (:host github :repo "Malabarba/beacon"))

(package! guess-language
  :recipe (:host github :repo "tmalsburg/guess-language.el"))

(package! key-chord
  :recipe (:host github :repo "emacsorphanage/key-chord"))

(package! imenu-list
  :recipe (:host github :repo "bmag/imenu-list"))
