config.org
** TODO Capture templates
Here I will add template captures for doing several things:

#+begin_src emacs-lisp
(after! org
  (setq org-capture-templates'(
                               ("i" "Inbox" entry
                                (file+headline "~/Nextcloud/agenda/tasks.org" "Inbox")
                                "* TODO %i%? \nEntered on %U"
                                :empty-lines-after 2)
                               )
        )
)
  ;; (setq org-capture-templates'(
  ;;                              ("t" "My TODO task format." entry
  ;;                               (file+headline "~/Nextcloud/agenda/inbox.org" "Tasks")
  ;;                               "** TODO %i%? %^g \n%U"
  ;;                               :empty-lines-after 1)

  ;;                              ("p" "New project." entry
  ;;                               (file+headline "~/Nextcloud/agenda/tasks.org" "Projects")
  ;;                               "** TODO %? %^g \n%U\n- Objetivo:"
  ;;                               :empty-lines-after 1)

  ;;                              ("c" "New calendar entry." entry
  ;;                               (file+headline "~/Nextcloud/agenda/tasks.org" "Calendar")
  ;;                               "** TODO %i%?\nSCHEDULED: %^t\n"
  ;;                               :empty-lines-after 1)

  ;;                              ;; Writing related things
  ;;                              ("i" "Writing idea." entry
  ;;                               (file+headline "~/Nextcloud/escritura/ideas/ideas.org" "otras")
  ;;                               "** TODO %?\n*** Personajes\n- \n*** Ambientación\n*** Eventos\n"
  ;;                               :empty-lines-after 1)

  ;;                              ("P" "Personaje" entry
  ;;                               (file "~/Nextcloud/escritura/ideas/personajes.org")
  ;;                               "* "
  ;;                               :empty-lines-after 1)

  ;;                              ("h" "Compost heap" item
  ;;                               (file+headline "~/Nextcloud/escritura/ideas/compost_heap.org" "Compost heap")
  ;;                               "%i"
  ;;                               :empty-lines-after 1)

  ;;                              ("r" "Note and misc content." entry
  ;;                               (file+headline "~/Nextcloud/agenda/inbox.org" "Notes")
  ;;                               "** %i%?\n"
  ;;                               :empty-lines-after 1)

  ;;                              ;; books to read
  ;;                              ("b" "Manual book entry" entry (file "~/Nextcloud/agenda/books.org")
  ;;                               "* %^{TITLE}\n:PROPERTIES:\n:ADDED: %<[%Y-%02m-%02d]>\n:END:%^{AUTHOR}p\n%?" :empty-lines 1)

  ;;                              ;; this one adds a book from an URL, *but you have to have the URL already in the kill ring* or it won't work
  ;;                              ("B" "Book with URL" entry (file "~/Nextcloud/agenda/books.org")
  ;;                               "%(let* ((url (substring-no-properties (current-kill 0)))
  ;;                 (details (org-books-get-details url)))
  ;;            (when details (apply #'org-books-format 1 details)))")

  ;; ;;     ("b" "books to read." entry
  ;; ;;       (file+headline "~/Nextcloud
  ;;                             /agenda/books.org" "Books")
  ;;       "* %^{Title}  %^g
  ;;       %i
  ;;       *Author(s):* %^{Author}
  ;;       ")

  ;; linea en tabla
  ;;  ("w" "peso" table-line
  ;;     (file+headline "~/Nextcloud/personal/peso.org" "peso")
  ;;     "|%<%Y/%m/%d>|%i|")

  ;;    )
  ;; )
#+end_src

** TODO custom tags
Create custom tags for different categories and contexts

#+begin_src emacs-lisp
(after! org
  (setq org-tag-alist '(
                        ;; Contexts based on locations
                        ("work" . ?W) ("home" . ?h)  ("outside" . ?o)
                        ;; Contexts based on tools
                        ("computer" . ?c) ("mobile" . ?m)  ("penpaper" . ?p)
                        ;; Contexts based on activities
                        ("emacs" . ?e)  ("writing" . ?w) ("reading" . ?r)
    )
  )
)
#+end_src
** Remove the markup indicators
No need to see the markup indicators when writing.

#+begin_src emacs-lisp
(after! org
  (setq org-hide-emphasis-markers t)
)
#+end_src

** org-appear
/Hides/ the *emphasis* marks +of+ from orgmode, until you are
#+begin_src emacs-lisp :tangle packages.el
(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))
#+end_src

#+begin_src emacs-lisp
  (use-package org-appear
    ;;:quelpa (org-appear :type git :host github :repo "awth13/org-appear")
    ;;:ensure t
    :hook (org-mode . org-appear-mode)
    )
#+end_src

** org word count
https://lists.gnu.org/archive/html/emacs-orgmode/2011-04/msg00713.html
#+begin_src emacs-lisp :tangle packages.el
(package! org-wc
  :recipe (:host github :repo "tesujimath/org-wc"))
#+end_src

** org-ql
Better queries for org-ql.
#+begin_src emacs-lisp :tangle packages.el
(package! org-ql
  :recipe (:host github :repo "alphapapa/org-ql"))
#+end_src
** org-roam
Org-roam related config.

#+begin_src emacs-lisp
(setq org-roam-v2-ack t)
(setq org-roam-directory (file-truename "~/Nextcloud/personal/roam"))

;; ("C-c n l" . org-roam-buffer-toggle)
;; ("C-c n f" . org-roam-node-find)
;; ("C-c n i" . org-roam-node-insert)
;; ("C-c n c" . org-roam-capture)
;; :map org-roam-dailies-map
;; ("Y" . org-roam-dailies-capture-yesterday)
;; ("T" . org-roam-dailies-capture-tomorrow)
;; :bind-keymap
;; ("C-c n d" . org-roam-dailies-map)

;; provide org-roam completion links outside org files.
(setq org-roam-completion-everywhere t)
;; Location of the roam database
(setq org-roam-db-location (file-truename "~/Nextcloud/personal/roam/org-roam.db"))
;; Ensure the keymap is available
;;(require 'org-roam-dailies)
;; org-roam export: https://www.orgroam.com/manual.html#org_002droam_002dexport
;;      (require 'org-roam-export)
;; autosync
(org-roam-db-autosync-mode 1)
#+end_src

*** org-roam templates
#+begin_src emacs-lisp
  (setq org-roam-capture-templates
        '(
          ;; default template
          ("d" "default" plain
           "* TODO ${title}\n%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
           :unnarrowed t)
          ("b" "book notes" plain (file "~/.emacs.d/roamtemplates/BookNoteTemplate.org")
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: book")
           :unnarrowed t)
          ("w" "writing idea" plain (file "~/.emacs.d/roamtemplates/WritingIdea.org")
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: writing")
           :unnarrowed t)
          ("c" "writing character" plain (file "~/.emacs.d/roamtemplates/CharacterIdea.org")
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: writing character")
           :unnarrowed t)
          )
        )
#+end_src

*** Search by title and tags
To search by title and tags, we will use the information contained here:
https://github.com/org-roam/org-roam/pull/2054
#+begin_src emacs-lisp
   (setq org-roam-node-display-template
      (concat "${title:*} "
              (propertize "${tags:20}" 'face 'org-tag)))
#+end_src

*** Search using content or roam using ripgrep
This does full text search on my roam notes.
#+begin_src emacs-lisp
(defun my/org-roam-rg-search ()
  "Search org-roam directory using consult-ripgrep. With live-preview."
  (interactive)
  (let ((consult-ripgrep-command "rg --null --ignore-case --type org --line-buffered --color=always --max-columns=500 --no-heading --line-number . -e ARG OPTS"))
    (consult-ripgrep org-roam-directory)))
(global-set-key (kbd "C-c rr") 'my/org-roam-rg-search)
#+end_src
*** Dailies config
#+begin_src emacs-lisp
  ;; Daily notes for org-roam
  ;; Directory is relative to org-roam-directory
  (setq org-roam-dailies-directory "daily/")

  ;; Capture template for the dailies
  (setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         "* %?"
         :if-new (file+head "%<%Y-%m-%d>.org"
                            "#+title: %<%Y-%m-%d>\n#+filetags: daily\n"))))
#+end_src

*** org-roam TODOs to the agenda
I want to get all my org-roam TODOs in the agenda view, but I need to do it only with the files that contain the TODO keywords, and not the whole org-roam directory.

https://d12frosted.io/posts/2021-01-16-task-management-with-roam-vol5.html

#+begin_src emacs-lisp
  ;; we want to load these functions if org-roam is present
  (if (not(require 'org-roam nil t))
          ;; if condition
          (message "org-roam not found")
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; else condition

    (setq my/roamtag "roamtag")

    (defun vulpea-buffer-prop-set (name value)
        "Set a file property called NAME to VALUE in buffer file.
          If the property is already set, replace its value."
        (setq name (downcase name))
        (org-with-point-at 1
          (let ((case-fold-search t))
            (if (re-search-forward (concat "^#\\+" name ":\\(.*\\)")
                                   (point-max) t)
                (replace-match (concat "#+" name ": " value) 'fixedcase)
              (while (and (not (eobp))
                          (looking-at "^[#:]"))
                (if (save-excursion (end-of-line) (eobp))
                    (progn
                      (end-of-line)
                      (insert "\n"))
                  (forward-line)
                  (beginning-of-line)))
              (insert "#+" name ": " value "\n")))))

    (defun vulpea-buffer-prop-set-list (name values &optional separators)
      "Set a file property called NAME to VALUES in current buffer.
          VALUES are quoted and combined into single string using
          `combine-and-quote-strings'.
          If SEPARATORS is non-nil, it should be a regular expression
          matching text that separates, but is not part of, the substrings.
          If nil it defaults to `split-string-default-separators', normally
          \"[ \f\t\n\r\v]+\", and OMIT-NULLS is forced to t.
          If the property is already set, replace its value."
      (vulpea-buffer-prop-set
       name (combine-and-quote-strings values separators)))

    (defun vulpea-buffer-tags-set (&rest tags)
      "Set TAGS in current buffer.
            If filetags value is already set, replace it."
      (vulpea-buffer-prop-set "filetags" (string-join tags " ")))

    (defun vulpea-buffer-prop-get (name)
      "Get a buffer property called NAME as a string."
      (org-with-point-at 1
        (when (re-search-forward (concat "^#\\+" name ": \\(.*\\)")
                                 (point-max) t)
          (buffer-substring-no-properties
           (match-beginning 1)
           (match-end 1)))))


    (defun vulpea-buffer-prop-get-list (name &optional separators)
      "Get a buffer property NAME as a list using SEPARATORS.
              If SEPARATORS is non-nil, it should be a regular expression
              matching text that separates, but is not part of, the substrings.
              If nil it defaults to `split-string-default-separators', normally
              \"[ \f\t\n\r\v]+\", and OMIT-NULLS is forced to t."
      (let ((value (vulpea-buffer-prop-get name)))
        (when (and value (not (string-empty-p value)))
          (split-string-and-unquote value separators))))

    (defun vulpea-buffer-tags-get ()
      "Return filetags value in current buffer."
      (vulpea-buffer-prop-get-list "filetags" " "))

    (defun vulpea-buffer-tags-add (tag)
      "Add a TAG to filetags in current buffer."
      (let* ((tags (vulpea-buffer-tags-get))
             (tags (append tags (list tag))))
        (apply #'vulpea-buffer-tags-set tags)))



    (defun vulpea-project-p ()
      "Return non-nil if current buffer has any todo entry.

                  TODO entries marked as done are ignored, meaning the this
                  function returns nil if current buffer contains only completed
                  tasks."
      (seq-find                                 ; (3)
       (lambda (type)
         (eq type 'todo))
       (org-element-map                         ; (2)
           (org-element-parse-buffer 'headline) ; (1)
           'headline
         (lambda (h)
           (org-element-property :todo-type h)))))

    (defun vulpea-project-update-tag ()
      "Update PROJECT tag in the current buffer."
      (when (and (not (active-minibuffer-window))
                 (vulpea-buffer-p))
        (save-excursion
          (goto-char (point-min))
          (let* ((tags (vulpea-buffer-tags-get))
                 (original-tags tags))
            (if (vulpea-project-p)
                (setq tags (cons "roamtag" tags))
              (setq tags (remove "roamtag" tags)))

            ;; cleanup duplicates
            (setq tags (seq-uniq tags))

            ;; update tags if changed
            (when (or (seq-difference tags original-tags)
                      (seq-difference original-tags tags))
              (apply #'vulpea-buffer-tags-set tags))))))

    (defun vulpea-buffer-p ()
      "Return non-nil if the currently visited buffer is a note."
      (and buffer-file-name
           (string-prefix-p
            (expand-file-name (file-name-as-directory org-roam-directory))
            (file-name-directory buffer-file-name))))

    (defun vulpea-project-files ()
      "Return a list of note files containing 'roamtag' tag." ;
      (seq-uniq
       (seq-map
        #'car
        (org-roam-db-query
         [:select [nodes:file]
                  :from tags
                  :left-join nodes
                  :on (= tags:node-id nodes:id)
                  :where (like tag (quote "%\"roamtag\"%"))]))))

    ;; This will overwrite the current agenda files, and we don't want that
    (defun vulpea-agenda-files-update (&rest _)
      "Update the value of `org-agenda-files'."
      (setq org-agenda-files (vulpea-project-files)))

    (defun inject-vulpea-project-files (org-agenda-files)
      (append org-agenda-files (vulpea-project-files)))
    (advice-add 'org-agenda-files :filter-return #'inject-vulpea-project-files)

    (add-hook 'find-file-hook #'vulpea-project-update-tag)
    (add-hook 'before-save-hook #'vulpea-project-update-tag)

    ;; original code that overwrites the agenda files
    ;;  (advice-add 'org-agenda :before #'vulpea-agenda-files-update)
    ;;  (advice-add 'org-todo-list :before #'vulpea-agenda-files-update)
    )
#+end_src
*** org-roam-ui
Load org-roam UI and all its dependencies.

#+begin_src emacs-lisp :tangle packages.el
(package! org-roam-ui
  :recipe (:host github :repo "org-roam/org-roam-ui")
  )
#+end_src

#+begin_src emacs-lisp
(use-package! org-roam-ui
  :after org-roam
  :hook (org-roam . org-roam-ui-mode)
  )
#+end_src

* Writing
** TODO Word count
Word counting with objective.
I don't know if this is shown in the status line ...

#+begin_src emacs-lisp :tangle packages.el
(package! wc-mode
  :recipe (:host github :repo "bnbeckwith/wc-mode"))
#+end_src

#+begin_src emacs-lisp
(global-set-key (kbd "C-c 9") 'wc-mode)
(setq doom-modeline-enable-word-count t)
#+end_src

