packages.el

(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))

(package! org-wc
  :recipe (:host github :repo "tesujimath/org-wc"))

(package! org-ql
  :recipe (:host github :repo "alphapapa/org-ql"))

(package! org-roam-ui
  :recipe (:host github :repo "org-roam/org-roam-ui")
  )

(package! wc-mode
  :recipe (:host github :repo "bnbeckwith/wc-mode"))
