config.org
** word count track table
A table to track the advance of your writing
https://github.com/tty-tourist/org-tracktable

#+begin_src emacs-lisp :tangle packages.el
(package! org-tracktable
  :recipe (:host github :repo "tty-tourist/org-tracktable"))
#+end_src

#+begin_src emacs-lisp
(global-set-key (kbd "C-c 3") 'org-tracktable-status)
(global-set-key (kbd "C-c 4") 'org-tracktable-write)
#+end_src
** zen writing adjustments
Adjustments done to the zen mode for better visibility
#+begin_src emacs-lisp
(setq +zen-text-scale 2)
(setq writeroom-width 0.1)
#+end_src
** selectric - typing sound like a typewriter
#+begin_src emacs-lisp :tangle packages.el
(package! selectric-mode
  :recipe (:host github :repo "rbanffy/selectric-mode"))
#+end_src

This activates typewriter sounds when entering the writeroom mode, and
#+begin_src emacs-lisp
(defun my-writeroom-mode-hook ()
  "Custom behaviours for `writeroom-mode'."
  (if writeroom-mode
      (selectric-mode 1)
    (selectric-mode 0)))

(add-hook 'writeroom-mode-hook #'my-writeroom-mode-hook)
#+end_src

** TODO org-journal
This is for journaling every day, if possible.
Documentation can be found here:

https://github.com/bastibe/org-journal

#+begin_src emacs-lisp
      ;;("C-c r ñ" . org-journal-new-entry)
      (setq org-journal-date-prefix "#+TITLE: ")
      (setq org-journal-file-format "%Y-%m-%d.org")
      (setq org-journal-dir "~/Nextcloud/personal/diario/")
      (setq org-journal-date-format "%A, %d %B %Y")
      (setq org-journal-encrypt-journal nil)
#+end_src

** Buscar en la RAE
Seach a word in the spanish dictionary.

#+begin_src emacs-lisp
  (defun my/buscarae (palabra)
     "Busca una palabra en la RAE."
     (interactive "s¿Qué palabra quieres buscar? ")
     (eww (concat "https://dle.rae.es/" palabra))
  )
#+end_src

** Buscar sinónimos
Seach a synonim

#+begin_src emacs-lisp
  (defun my/sinonimo (palabra)
     "Busca una palabra en un diccionario de sinónimos"
     (interactive "s¿Qué palabra quieres buscar? ")
     (eww (concat "https://www.wordreference.com/sinonimos/" palabra))
  )
#+end_src

** Translate from english
Translate a word

#+begin_src emacs-lisp
  (defun my/translate (palabra)
    "Traduccion de inglés a español"
    (interactive "s¿Qué palabra quieres buscar? ")
    (eww (concat "https://www.deepl.com/translator#en/es/" palabra))
  )
#+end_src

* others
** elfeed
RSS feeds in emacs
#+begin_src emacs-lisp
(setq elfeed-db-directory "~/Nextcloud/config/.emacs.d/elfeed")
(global-set-key (kbd "C-c m w") 'elfeed)

(setq elfeed-feeds
      '(
        ;; security
        ("https://krebsonsecurity.com/feed/" security)
        ("https://www.schneier.com/feed/atom" security)
        ;; writing
        "https://www.helpingwritersbecomeauthors.com/feed/"
        "http://thewritepractice.com/feed/"
        ;; emacs
        "https://sachachua.com/blog/feed"
        )
      )
#+end_src
** TODO emms
Music from emacs
#+begin_src emacs-lisp
(require 'emms-setup)
(emms-all)
(emms-default-players)
;; Depending on the system, the music is one place or another
(if my-desktopsystem-p
    (setq emms-source-file-default-directory "/home/musica") ;; Change to your music folder
  )
(if my-worksystem-p
    (setq emms-source-file-default-directory "/home/jcastp/Música") ;; Change to your music folder
    )

;; fot the tagging of songs
(setq emms-info-functions '(emms-info-tinytag))

;; Keyboard shortcuts
(global-set-key (kbd "<XF86AudioPrev>") 'emms-previous)
(global-set-key (kbd "<XF86AudioNext>") 'emms-next)
(global-set-key (kbd "<XF86AudioPlay>") 'emms-pause)

(global-set-key (kbd "C-c m m") 'emms-browser)
#+end_src

** theme changer
I will write a function to change themes from a list
#+begin_src emacs-lisp
;; This is the list of themes I want to apply and rotate
(defvar my/themes '(doom-one
                    doom-one-light
                    doom-plain)
  "Stores the themes we want to change to.
The theme enabled will be the first of the list,
and then it will be pushed to the end of the list.
This way, we rotate the themes."
  )


(defun my/theme-changer()
  "Given a list of themes, it get the first one, applies it and adds it back to the list.

        The result is that we can rotate from a custom list of themes."
  (interactive)
  ;; obtain the first item of the list, extract it, apply it, and put it back to the end of the list
  (setq my/first-theme (car my/themes))
  ;;(message "theme is %s" my/first-theme)
  (setq my/themes
        (nconc (last my/themes) (butlast my/themes)))
                                        ;(disable-theme doom-theme)
                                        ;(enable-theme my/first-theme)
  (consult-theme my/first-theme)
  (message "Applied the theme %s" my/first-theme)
  )

(global-set-key (kbd "C-c 0") 'my/theme-changer)
#+end_src

* testing
** TODO org-ref
For bibliographical references
#+begin_src emacs-lisp :tangle packages.el
(package! org-ref
  :recipe (:host github :repo "jkitchin/org-ref"))
#+end_src
** TODO org-cv
To create a CV based on the orgmode cv
https://gitlab.com/Titan-C/org-cv
#+begin_src emacs-lisp :tangle packages.el
(package! org-ref
  :recipe (:host gitlab :repo "Titan-C/org-cv"))
#+end_src

* Work environment
This will be my working environment config
#+begin_src emacs-lisp
    ;; Load this config when using the work computer
  (if my-workenvironment-p
         (progn
           (org-babel-load-file "~/.doom.d/emacs-org-init-trabajo.org")
      )
    )
#+end_src
