packages.el

(package! org-tracktable
  :recipe (:host github :repo "tty-tourist/org-tracktable"))

(package! selectric-mode
  :recipe (:host github :repo "rbanffy/selectric-mode"))

(package! org-ref
  :recipe (:host github :repo "jkitchin/org-ref"))
